window.onload = function()  {
    let sayarray = [];
    sayarray[0]="لا يمكن تحقيق النجاح الأ أذا أحببت ما تقوم به";
    sayarray[1]="السر الأعظم للنجاح فى الحياة هو أن تدرك ما المقدر لك فعله ثم تقوم بفعله";
    sayarray[2]="النجاح عادة يأتى لهؤلاء الذين مشغولون جدآ ليبحثوا عنه";
    sayarray[3]="النجاح هو حصيلة مجهودات صغيرة نكررها كل يوم";
    sayarray[4]="أصنع النجاح من الأخفاقات ،خيبة الأمل والفشل من الدرجات التى ترتقي عليها للنجاح";
    sayarray[5]="الناجح يكرهه اثنان : الجاهل و الحاقد";
    sayarray[6]="أنتظار النجاح بدون العمل الشاق لتحقيقة يعادل أنتظار الحصاد بدون بذر البذور";
    sayarray[7]="النجاح ليس عدم فعل الأخطاء ، النجاح هو عدم تكرار الخطأ";
    sayarray[8]="تموت الأسد في الغابات جوعًا … ولحم الضأن تأكله الكــلاب";
    sayarray[9]="وعبد قد ينام على حريـــر … وذو نسب مفارشه التــراب";
    sayarray[10]="من لم يذق مر التعلم ساعــة … تجرع ذل الجهل طول حياته";
    sayarray[11]="تستر بالسخاء فكل عيب … يغطيه كما قيل السخاء";
    sayarray[12]="دع الأيام تغدر كل حين … فما يغني عن الموت الدواء";
    sayarray[13]="أكثر الناس تحقيقا للنجاح هم أولئك الذين يدركون أن الفشل هو أمر لا مفر منه";
    sayarray[14]="إذا لم تكن لديك الرغبة في المخاطرة في بعض الأحيان، فعليك أن ترضى بأن تكون شخصا عاديا";
    sayarray[15]="ليست السرعة التي تسير بها مهمة ما دمت لن تتوقف عن السير";
    sayarray[16]="النجاح هو أن تنتقل من فشل إلى فشل دون أن تفقد حماسك وشغفك لتحقيق ما تريده";
    sayarray[17]="العقول العظيمة تتحدث بشأن الأفكار، العقول العادية تتحدث بشأن الأحداث، أما العقول الصغيرة فتتحدث دائما عن الناس";
    sayarray[18]="اعمل لدنياك كأنك تعيش ابدا .. و اعمل لاخرتك كأنك تموت غدا";
    sayarray[19]="فرزقك لا ينقصه التأني ... ولا يزيد في الرزق العناء";
    /*sayarray[20]="";
    sayarray[21]="";
    sayarray[22]="";
    sayarray[23]="";
    sayarray[24]="";
    sayarray[25]="";
    sayarray[26]="";
    sayarray[27]="";
    sayarray[28]="";
    sayarray[29]="";
    sayarray[30]="";
    sayarray[31]="";
    sayarray[32]="";
    sayarray[33]="";
    sayarray[34]="";
    sayarray[35]="";*/


    let randomnumber = Math.floor(Math.random()*sayarray.length)
    var about = document.getElementById("say");
    about.innerText = sayarray[randomnumber];

    var theme = document.querySelector('a[data-theme="blue-mountains"]');
    theme.setAtrribute('data-theme','original');
}